{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "/root/autodl-tmp/russwest/meta-comphrehensive-rag-benchmark-starter-kit/models/llama3",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 16,
  "lora_dropout": 0.0,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 8,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "q_proj",
    "v_proj"
  ],
  "task_type": "SEQ_CLS",
  "use_dora": false,
  "use_rslora": false
}